app/views/employees/_form.html.erb

    <% @posts.each do |post| %>
      <%= check_box_tag "employee[post_ids][]", post.id, @employee.post_ids.include?(post.id) %>
---
SELECT `posts`.id FROM `posts` INNER JOIN `employees_posts` ON `posts`.`id` = `employees_posts`.`post_id` WHERE `employees_posts`.`employee_id` IS NULL