app/views/employees/index.html.erb


  <% @employees.includes(:posts,:departments).each do |employee| %>
---
SELECT `departments`.* FROM `departments` INNER JOIN `posts` ON `departments`.`id` = `posts`.`department_id` INNER JOIN `employees_posts` ON `posts`.`id` = `employees_posts`.`post_id` WHERE `employees_posts`.`employee_id` = 1
SELECT `posts`.*, `t0`.`employee_id` AS ar_association_key_name FROM `posts` INNER JOIN `employees_posts` `t0` ON `posts`.`id` = `t0`.`post_id` WHERE `t0`.`employee_id` IN (1, 2, 3, 4)