app/views/posts/index.html.erb

SELECT `departments`.* FROM `departments` WHERE `departments`.`id` IN (7)
---

  <% @posts.includes(:department).each do |post| %>