app/controllers/departments_controller.rb

  def show
    @department = Department.find(params[:id])
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1

  def edit
    @department = Department.find(params[:id])
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 7 LIMIT 1

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO `departments` (`ancestry`, `created_at`, `name`, `updated_at`) VALUES (NULL, '2014-06-25 10:52:11', '董事会', '2014-06-25 10:52:11')

  def update
    @department = Department.find(params[:id])

    respond_to do |format|
      if @department.update_attributes(params[:department])
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 13 LIMIT 1
UPDATE `departments` SET `name` = 'Schowalter', `updated_at` = '2014-06-26 08:32:05' WHERE `departments`.`id` = 92

  def destroy
    @department = Department.find(params[:id])
    @department.destroy
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 11 LIMIT 1
DELETE FROM `departments` WHERE `departments`.`id` = 11