app/controllers/employees_controller.rb

  def index
    @employees = Employee.paginate per_page: 20, page: params[:page]
---
SELECT COUNT(*) FROM `employees`
SELECT `employees`.* FROM `employees` LIMIT 20 OFFSET 0

  def show
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def edit
    @employee = Employee.find(params[:id])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1

  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save
---
INSERT INTO `employees` (`address`, `created_at`, `department`, `mobile_phone`, `name`, `telephone`, `title`, `updated_at`) VALUES (NULL, '2014-06-25 14:09:21', NULL, NULL, '43433', NULL, NULL, '2014-06-25 14:09:21')

  def update
    @employee = Employee.find(params[:id])

    respond_to do |format|
      if @employee.update_attributes(params[:employee])
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
UPDATE `employees` SET `name` = 'ElianKshlerin', `address` = 'Marisolfort', `mobile_phone` = '326-884-1069 x70942', `telephone` = '1-584-410-9396 x141', `updated_at` = '2014-06-26 08:50:05' WHERE `employees`.`id` = 16

  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 21 LIMIT 1
DELETE FROM `employees` WHERE `employees`.`id` = 21