app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate :per_page => 15, :page => params[:page]
---
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` LIMIT 20 OFFSET 0

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `department_id`, `name`, `updated_at`) VALUES ('2014-06-25 13:19:16', 7, '董事长', '2014-06-25 13:19:16')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
UPDATE `posts` SET `name` = 'Amelie', `department_id` = 158, `updated_at` = '2014-06-26 08:44:17' WHERE `posts`.`id` = 78